/*
 1. Создать класс человек. У него должны быть свойства: Папа Мама Братья Сестры (массивы), все опционально
 создать 20 экземпляров класса, создать для одного из них папу и маму
 Папе и маме тоже поставить братьев сестер пап мам(все проперти опциональны-могут быть могут отсутствовать)
 Посчитать для главного героя количество двоюродных братьев, дядь и теть используя опциональные цепочки
 2. Создать класс мущина и женщина , унаследованные от класса Человек.
 У всех мужчин сделать метод Двигать диван, у женщин Готовить еду.
 Создать массив со всеми экземплярами класса. Посчитать сколько среди людей мужчин, женщин, и для
 каждого вызвать его метод.
 3 Создать для класса человек свойство - Домашнее животное(попугай, кошка, собака)
 Пройтись по массиву людей, определить есть ли у них животное, если животное есть оперделить их
 к одному из 3 типов Кошатники, Собачники, Птичники
 4. Все животные унаследованы от класса животные, в котором есть метод издать звук.
 При прохождении по массиву животных каждое из них должно издавать свой крик
 */
